modm-ext/data.modm.io/docs/svd/header_stm32l4s9xx.svd
        <register>
          <name>CH3AWSCDR</name>
          <description>DFSDM channel analog watchdog and short circuit detector register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SCDT</name>
              <description>SCDT[7:0] Short circuit detector threshold for channel y</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BKSCD</name>
              <description>BKSCD[3:0] Break signal assignment for short circuit detector on channel y</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AWFOSR</name>
              <description>AWFOSR[4:0] Analog watchdog filter oversampling ratio on channel y</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>AWFORD</name>
              <description>AWFORD[1:0] Analog watchdog Sinc filter order on channel y</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3WDATAR</name>
          <description>DFSDM channel watchdog filter data register</description>
          <addressOffset>0x6c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CH3DATINR</name>
          <description>DFSDM channel data input register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INDAT0</name>
              <description>INDAT0[31:16] Input data for channel y or channel (y+1)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>INDAT1</name>
              <description>INDAT0[15:0] Input data for channel y</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3DLYR</name>
          <description>DFSDM channel delay register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PLSSKP</name>
              <description>PLSSKP[5:0] Number of input serial samples that will be skipped</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4CFGR1</name>
          <description>DFSDM channel configuration register1</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SITP</name>
              <description>SITP[1:0] Serial interface type for channel y</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SPICKSEL</name>
              <description>SPICKSEL[1:0] SPI clock select for channel y</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SCDEN</name>
              <description>Short circuit detector enable on channel y</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKABEN</name>
              <description>Clock absence detector enable on channel y</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHEN</name>
              <description>Channel y enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHINSEL</name>
              <description>Serial inputs selection for channel y</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATMPX</name>
              <description>DATMPX[1:0] Input data multiplexer for channel y</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DATPACK</name>
              <description>DATPACK[1:0] Data packing mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CKOUTDIV</name>
              <description>CKOUTDIV[7:0] output serial clock divider</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CKOUTSRC</name>
              <description>Output serial clock source selection</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFSDMEN</name>
              <description>Global enable for DFSDM interface</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4CFGR2</name>
          <description>DFSDM channel configuration register2</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DTRBS</name>
              <description>DTRBS[4:0] Data right bit-shift for channel y</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OFFSET</name>
              <description>OFFSET[23:0] 24-bit calibration offset for channel y</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4AWSCDR</name>
          <description>DFSDM channel analog watchdog and short circuit detector register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SCDT</name>
              <description>SCDT[7:0] Short circuit detector threshold for channel y</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BKSCD</name>
              <description>BKSCD[3:0] Break signal assignment for short circuit detector on channel y</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AWFOSR</name>
              <description>AWFOSR[4:0] Analog watchdog filter oversampling ratio on channel y</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>AWFORD</name>
              <description>AWFORD[1:0] Analog watchdog Sinc filter order on channel y</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4WDATAR</name>
          <description>DFSDM channel watchdog filter data register</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CH4DATINR</name>
          <description>DFSDM channel data input register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INDAT0</name>
              <description>INDAT0[31:16] Input data for channel y or channel (y+1)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>INDAT1</name>
              <description>INDAT0[15:0] Input data for channel y</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4DLYR</name>
          <description>DFSDM channel delay register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PLSSKP</name>
              <description>PLSSKP[5:0] Number of input serial samples that will be skipped</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5CFGR1</name>
          <description>DFSDM channel configuration register1</description>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SITP</name>
              <description>SITP[1:0] Serial interface type for channel y</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SPICKSEL</name>
              <description>SPICKSEL[1:0] SPI clock select for channel y</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SCDEN</name>
              <description>Short circuit detector enable on channel y</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKABEN</name>
              <description>Clock absence detector enable on channel y</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHEN</name>
              <description>Channel y enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHINSEL</name>
              <description>Serial inputs selection for channel y</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATMPX</name>
              <description>DATMPX[1:0] Input data multiplexer for channel y</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DATPACK</name>
              <description>DATPACK[1:0] Data packing mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CKOUTDIV</name>
              <description>CKOUTDIV[7:0] output serial clock divider</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CKOUTSRC</name>
              <description>Output serial clock source selection</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFSDMEN</name>
              <description>Global enable for DFSDM interface</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5CFGR2</name>
          <description>DFSDM channel configuration register2</description>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DTRBS</name>
              <description>DTRBS[4:0] Data right bit-shift for channel y</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OFFSET</name>
              <description>OFFSET[23:0] 24-bit calibration offset for channel y</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5AWSCDR</name>
          <description>DFSDM channel analog watchdog and short circuit detector register</description>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SCDT</name>
              <description>SCDT[7:0] Short circuit detector threshold for channel y</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BKSCD</name>
              <description>BKSCD[3:0] Break signal assignment for short circuit detector on channel y</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AWFOSR</name>
              <description>AWFOSR[4:0] Analog watchdog filter oversampling ratio on channel y</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>AWFORD</name>
              <description>AWFORD[1:0] Analog watchdog Sinc filter order on channel y</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5WDATAR</name>
          <description>DFSDM channel watchdog filter data register</description>
          <addressOffset>0xac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CH5DATINR</name>
          <description>DFSDM channel data input register</description>
          <addressOffset>0xb0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INDAT0</name>
              <description>INDAT0[31:16] Input data for channel y or channel (y+1)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>INDAT1</name>
              <description>INDAT0[15:0] Input data for channel y</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5DLYR</name>
          <description>DFSDM channel delay register</description>
          <addressOffset>0xb4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PLSSKP</name>
              <description>PLSSKP[5:0] Number of input serial samples that will be skipped</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH6CFGR1</name>
          <description>DFSDM channel configuration register1</description>
          <addressOffset>0xc0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SITP</name>
              <description>SITP[1:0] Serial interface type for channel y</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SPICKSEL</name>
              <description>SPICKSEL[1:0] SPI clock select for channel y</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SCDEN</name>
              <description>Short circuit detector enable on channel y</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKABEN</name>
              <description>Clock absence detector enable on channel y</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHEN</name>
              <description>Channel y enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHINSEL</name>
              <description>Serial inputs selection for channel y</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATMPX</name>
              <description>DATMPX[1:0] Input data multiplexer for channel y</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DATPACK</name>
              <description>DATPACK[1:0] Data packing mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CKOUTDIV</name>
              <description>CKOUTDIV[7:0] output serial clock divider</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CKOUTSRC</name>
              <description>Output serial clock source selection</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFSDMEN</name>
              <description>Global enable for DFSDM interface</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH6CFGR2</name>
          <description>DFSDM channel configuration register2</description>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DTRBS</name>
              <description>DTRBS[4:0] Data right bit-shift for channel y</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OFFSET</name>
              <description>OFFSET[23:0] 24-bit calibration offset for channel y</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH6AWSCDR</name>
          <description>DFSDM channel analog watchdog and short circuit detector register</description>
          <addressOffset>0xc8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SCDT</name>
              <description>SCDT[7:0] Short circuit detector threshold for channel y</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BKSCD</name>
              <description>BKSCD[3:0] Break signal assignment for short circuit detector on channel y</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AWFOSR</name>
              <description>AWFOSR[4:0] Analog watchdog filter oversampling ratio on channel y</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>AWFORD</name>
              <description>AWFORD[1:0] Analog watchdog Sinc filter order on channel y</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH6WDATAR</name>
          <description>DFSDM channel watchdog filter data register</description>
          <addressOffset>0xcc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CH6DATINR</name>
          <description>DFSDM channel data input register</description>
          <addressOffset>0xd0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INDAT0</name>
              <description>INDAT0[31:16] Input data for channel y or channel (y+1)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>INDAT1</name>
              <description>INDAT0[15:0] Input data for channel y</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH6DLYR</name>
          <description>DFSDM channel delay register</description>
          <addressOffset>0xd4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PLSSKP</name>
              <description>PLSSKP[5:0] Number of input serial samples that will be skipped</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
